---
kind: property
id: P:Autodesk.Revit.DB.SpotDimension.SpotDimensionType
source: html/e653cdb6-319d-6c7a-c5b0-16992144e6f6.htm
---
# Autodesk.Revit.DB.SpotDimension.SpotDimensionType Property

The dimension style of this dimension.

## Syntax (C#)
```csharp
public SpotDimensionType SpotDimensionType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null